[Timeout] BlockStatement
src/Roller.ts:9:34
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-      constructor(faces: number) {
-        if (faces < 2) {
-          faces = 6;
-        }
-        this._faces = faces;
-        this._last = 0;
-        this._distribution = new Map<number, number>();
-        for (let i = 1; i <= faces; i++) {
-          this._distribution.set(i, 0);
-        }
-      }
+      constructor(faces: number) {}
     
 

[Killed] EqualityOperator
src/Roller.ts:16:25
         this._faces = faces;
         this._last = 0;
         this._distribution = new Map<number, number>();
-        for (let i = 1; i <= faces; i++) {
+        for (let i = 1; i < faces; i++) {
           this._distribution.set(i, 0);
         }
killedBy: Roller should initialize a Roller object correctly with a size of 6 and set last roll to 0 and distribution to 0 for each face
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Timeout] UpdateOperator
src/Roller.ts:16:37
         this._faces = faces;
         this._last = 0;
         this._distribution = new Map<number, number>();
-        for (let i = 1; i <= faces; i++) {
+        for (let i = 1; i <= faces; i--) {
           this._distribution.set(i, 0);
         }

[Timeout] BlockStatement
src/Roller.ts:33:33
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
 
-    roll(value: number): number {
-        if (value < 1 || value > this._faces) {
-          return 0;
-        }
-        this._last = value;
-        this._distribution.set(value, this._distribution.get(value)! + 1);
-        return value;
-      }
+    roll(value: number): number {}
 
     // returns the value of the latest die roll. If no rolls have been made
